Tekla Open API Reference for Tekla Structures 2025
IRelatedObjects.GetRelatedObjects Method (Type[])
 Gets the related objects of the current object that are of certain types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
DrawingObjectEnumerator GetRelatedObjects(
	Type[] TypeFilter
)
Function GetRelatedObjects (
	TypeFilter As Type()
) As DrawingObjectEnumerator
Parameters
TypeFilter
Type: System.Type[]
The types of the objects to get.
Return Value
Type: DrawingObjectEnumerator
The related objects of the current object that are of certain types.
See Also
Reference
IRelatedObjects Interface
GetRelatedObjects Overload
Tekla.Structures.Drawing Namespace